Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes.ForceStraightSegmentsEnum Enumeration
 The straight force segments.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ForceStraightSegmentsEnum
Public Enumeration ForceStraightSegmentsEnum
Members
Member name | Value | Description
FORCE_STRAIGHT_SEGMENTS_NOT_SET | 9 |  The straight force segments setting "not set".
FORCE_STRAIGHT_SEGMENTS_YES | 0 |  The straight force segments setting "yes".
FORCE_STRAIGHT_SEGMENTS_NO | 1 |  The straight force segments setting "no".
See Also
Reference
Tekla.Structures.Analysis Namespace